       ID DIVISION.
       PROGRAM-ID. CICSUSER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WRK.
           03  W-RREALM            PIC N(256) USAGE NATIONAL.
           03  W-RUSER             PIC N(256) USAGE NATIONAL.
       LINKAGE SECTION.
       01  DFHCOMMAREA.
           03  CICS-USER           PIC X(8).
           03  RACF-RREALM         PIC X(256).
           03  RACF-RUSER          PIC X(256).
       PROCEDURE DIVISION.
       1.  EXEC CICS ASSIGN USERID(CICS-USER) END-EXEC.
      *    EXEC CICS INQUIRE ASSOCIATION(EIBTASKN) DNAME(W-RUSER)
      *              REALM(W-RREALM) END-EXEC.
      *    MOVE FUNCTION DISPLAY-OF (W-RUSER,  1208) TO RACF-RUSER.
      *    MOVE FUNCTION DISPLAY-OF (W-RREALM, 1208) TO RACF-RREALM.
           EXEC CICS RETURN END-EXEC.